Hey I wanted to follow up on this because unfortunately it doesn't look like the Nomad 1.3.0 fixes actually fixed anything here, and it doesn't look like it's related to redaction.

I ran the following on my local environment with the current `main` of Nomad:

<details><summary>terraform config</summary>

```hcl
provider "nomad" {
  address = "http://localhost:4646"
  region  = "global"
}

resource "nomad_external_volume" "volume0" {
  type         = "csi"
  plugin_id    = "org.democratic-csi.nfs"
  volume_id    = "csi-volume-nfs"
  name         = "csi-volume-nfs"
  capacity_min = "1GiB"
  capacity_max = "1GiB"

  capability {
    access_mode     = "single-node-writer"
    attachment_mode = "file-system"
  }

  mount_options {
    mount_flags = ["noatime"]
  }
}
```

</details>

<details><summary>terraform apply</summary>

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nomad_external_volume.volume0 will be created
  + resource "nomad_external_volume" "volume0" {
      + capacity_max            = "1GiB"
      + capacity_min            = "1GiB"
      + controller_required     = (known after apply)
      + controllers_expected    = (known after apply)
      + controllers_healthy     = (known after apply)
      + id                      = (known after apply)
      + name                    = "csi-volume-nfs"
      + namespace               = "default"
      + nodes_expected          = (known after apply)
      + nodes_healthy           = (known after apply)
      + plugin_id               = "org.democratic-csi.nfs"
      + plugin_provider         = (known after apply)
      + plugin_provider_version = (known after apply)
      + schedulable             = (known after apply)
      + type                    = "csi"
      + volume_id               = "csi-volume-nfs"

      + capability {
          + access_mode     = "single-node-writer"
          + attachment_mode = "file-system"
        }

      + mount_options {
          + mount_flags = [
              + "noatime",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

nomad_external_volume.volume0: Creating...
nomad_external_volume.volume0: Creation complete after 0s [id=csi-volume-nfs]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

</details>

The results in the CLI:

```
$ nomad volume status csi-volume-nfs
ID                   = csi-volume-nfs
Name                 = csi-volume-nfs
External ID          = csi-volume-nfs
Plugin ID            = org.democratic-csi.nfs
Provider             = org.democratic-csi.nfs
Version              = 1.6.1
Schedulable          = false
Controllers Healthy  = 1
Controllers Expected = 1
Nodes Healthy        = 0
Nodes Expected       = 0
Access Mode          = <none>
Attachment Mode      = <none>
Mount Options        = <none>
Namespace            = default

Allocations
No allocations placed
```

Ok, so maybe it's a problem with the CLI. Let's check the API:

```
$ nomad operator api '/v1/volume/csi/csi-volume-nfs' | jq .MountOptions
{
  "MountOptions": {
    "FSType": "",
    "MountFlags": null
  }
}
```

Nope, that's not it. Just to make sure it's not an issue with the Nomad API's redaction of the outputs, I went directly to the state store:

```
$ sudo nomad operator raft state . | jq '.CSIVolumes[0].MountOptions'
{
  "FSType": "",
  "MountFlags": null
}
```

The data just isn't there. But if I create the same volume via `nomad volume create`, I can see the mount flags (redacted) as expected:

```
$ nomad operator api '/v1/volume/csi/csi-volume-nfs' | jq '.MountOptions'
{
  "FSType": "",
  "MountFlags": [
    "[REDACTED]"
  ]
}
```

I'll dig into the provider code a bit to see if I can figure out what's going on there.
